tap "docker/tap", trusted: { casks: ["sbx"] }
tap "ymtdzzz/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Bash Automated Testing System
brew "bats-core"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of djb's redo, a Makefile replacement that sucks less
brew "goredo"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Command-line pager for JSON data
brew "jless"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Tools for manipulating MSDOS files
brew "mtools"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Soak up standard input and write to a file
brew "sponge"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "ymtdzzz/tap/otel-tui", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Mobile gaming platform
cask "bluestacks"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Minecraft modding platform
cask "modrinth"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recorder and editor
cask "screenkite"
# Instant messaging application focusing on security
cask "signal"
# Native screenshots, recording, annotation, and editing from the menu bar
cask "snapzy"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
npm "@cmdctrl/claude-code"
npm "@earendil-works/pi-coding-agent"
npm "pi-llama-cpp"
