tap "homebrew/bundle"
brew "bash"
brew "direnv"
brew "eza"
brew "fd"
brew "gh"
brew "git-lfs"
brew "hugo"
brew "imagemagick"
brew "midnight-commander"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zoxide"
cask "alacritty"
cask "font-terminess-ttf-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "raycast"
cask "visual-studio-code"
cask "whatsapp"
vscode "github.copilot"
vscode "github.copilot-chat"
